ci4/app/Controllers/Admin/BranchManagementController.php

SELECT `branch_id`, `branch_name`, `status`
FROM `branches`
ORDER BY `branch_name` ASC
---
    public function index(): string
    {
        $this->ensureAdminAccess();

        $db = db_connect();
        $tab = (string) $this->request->getGet('tab');
        if (! in_array($tab, ['availability', 'transactions', 'contribution', 'approval'], true)) {
            $tab = 'availability';
        }

        $approvalTab = (string) $this->request->getGet('approval_tab');
        if (! in_array($approvalTab, ['services', 'packages'], true)) {
            $approvalTab = 'services';
        }

        $branchId = (int) $this->request->getGet('branch_id');
        $dateFrom = trim((string) $this->request->getGet('date_from'));
        $dateTo = trim((string) $this->request->getGet('date_to'));

        $branches = $db->table('branches')
            ->select('branch_id, branch_name, status')
            ->orderBy('branch_name', 'ASC')
            ->get()
            ->getResultArray();

SELECT `ps`.`pending_service_id`, `ps`.`service_name`, `ps`.`description`, `ps`.`base_price`, `ps`.`requested_status`, `ps`.`status`, `ps`.`created_at`, `u`.`first_name`, `u`.`last_name`
FROM `pending_services` `ps`
LEFT JOIN `users` `u` ON `u`.`user_id` = `ps`.`created_by`
ORDER BY `ps`.`created_at` DESC
SELECT `pp`.`pending_package_id`, `pp`.`package_name`, `pp`.`description`, `pp`.`base_price`, `pp`.`is_customizable`, `pp`.`initial_effective_date`, `pp`.`service_list_ids`, `pp`.`status`, `pp`.`created_at`, `u`.`first_name`, `u`.`last_name`
FROM `pending_packages` `pp`
LEFT JOIN `users` `u` ON `u`.`user_id` = `pp`.`created_by`
ORDER BY `pp`.`created_at` DESC
---
        $transactions = $this->buildTransactionRows($branchId, $dateFrom, $dateTo);
        $contributions = $this->buildContributionRows($branchId);

        $pendingServices = $db->table('pending_services ps')
            ->select('ps.pending_service_id, ps.service_name, ps.description, ps.base_price, ps.requested_status, ps.status, ps.created_at, u.first_name, u.last_name')
            ->join('users u', 'u.user_id = ps.created_by', 'left')
            ->orderBy('ps.created_at', 'DESC')
            ->get()
            ->getResultArray();

        $pendingPackages = $db->table('pending_packages pp')
            ->select('pp.pending_package_id, pp.package_name, pp.description, pp.base_price, pp.is_customizable, pp.initial_effective_date, pp.service_list_ids, pp.status, pp.created_at, u.first_name, u.last_name')
            ->join('users u', 'u.user_id = pp.created_by', 'left')
            ->orderBy('pp.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT b.branch_name, COALESCE(SUM(pay.amount), 0) AS total_collected
FROM `payments` `pay`
INNER JOIN `branches` `b` ON `b`.`branch_id` = `pay`.`branch_id`
WHERE `pay`.`status` = 'paid'
GROUP BY `b`.`branch_id`, `b`.`branch_name`
ORDER BY `b`.`branch_name` ASC
---
    private function buildContributionRows(int $branchId): array
    {
        $db = db_connect();

        $builder = $db->table('payments pay')
            ->select('b.branch_name, COALESCE(SUM(pay.amount), 0) AS total_collected', false)
            ->join('branches b', 'b.branch_id = pay.branch_id', 'inner')
            ->where('pay.status', 'paid')
            ->groupBy('b.branch_id, b.branch_name')
            ->orderBy('b.branch_name', 'ASC');

        if ($branchId > 0) {
            $builder->where('pay.branch_id', $branchId);
        }

        $rows = $builder->get()->getResultArray();