ci4/app/Controllers/Admin/ClientManagementController.php

SELECT `branch_id`, `branch_name`
FROM `branches`
ORDER BY `branch_name` ASC
---
    public function index(): string
    {
        $this->ensureAdminAccess();

        $db = db_connect();
        $branchId = (int) $this->request->getGet('branch_id');
        $status = strtolower(trim((string) $this->request->getGet('status')));
        $search = trim((string) $this->request->getGet('search'));

        $branches = $db->table('branches')
            ->select('branch_id, branch_name')
            ->orderBy('branch_name', 'ASC')
            ->get()
            ->getResultArray();