ci4/app/Helpers/QueryHelper.php

    public static function getBranchInfo(int $branchId): ?array
    {
        $db = \Config\Database::connect();

        return $db->table('branches')
            ->where('branch_id', $branchId)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `branches`
WHERE `branch_id` = 1

    public static function countPendingApprovals(int $branchId): int
    {
        $db = \Config\Database::connect();

        return $db->table('plan_holders')
            ->where('branch_id', $branchId)
            ->where('status', 'pending')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `plan_holders`
WHERE `branch_id` = 1
AND `status` = 'pending'

    public static function getMemberStats(int $branchId): array
    {
        $db = \Config\Database::connect();

        return [
            'total_active' => $db->table('plan_holders')
                ->where('branch_id', $branchId)
                ->where('status', 'active')
                ->countAllResults(),

            'total_pending' => $db->table('plan_holders')
                ->where('branch_id', $branchId)
                ->where('status', 'pending')
                ->countAllResults(),

            'total_delinquent' => $db->table('plan_holders')
                ->where('branch_id', $branchId)
                ->where('status', 'delinquent')
                ->countAllResults(),

            'total_suspended' => $db->table('plan_holders')
                ->where('branch_id', $branchId)
                ->where('status', 'suspended')
                ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `plan_holders`
WHERE `branch_id` = 1
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `plan_holders`
WHERE `branch_id` = 1
AND `status` = 'delinquent'
SELECT COUNT(*) AS `numrows`
FROM `plan_holders`
WHERE `branch_id` = 1
AND `status` = 'suspended'

    public static function getTotalCollections(int $branchId, string $startDate, string $endDate): float
    {
        $db = \Config\Database::connect();

        $result = $db->table('payments pay')
            ->selectSum('pay.amount', 'total')
            ->join('plans p', 'pay.plan_id = p.plan_id', 'left')
            ->join('plan_holders ph', 'p.plan_holder_id = ph.plan_holder_id', 'left')
            ->where('ph.branch_id', $branchId)
            ->where('pay.status', 'approved')
            ->where('DATE(pay.payment_date) >=', $startDate)
            ->where('DATE(pay.payment_date) <=', $endDate)
            ->get()
            ->getRowArray();
---
SELECT SUM(`pay`.`amount`) AS `total`
FROM `payments` `pay`
LEFT JOIN `plans` `p` ON `pay`.`plan_id` = `p`.`plan_id`
LEFT JOIN `plan_holders` `ph` ON `p`.`plan_holder_id` = `ph`.`plan_holder_id`
WHERE `ph`.`branch_id` = 1
AND `pay`.`status` = 'approved'
AND DATE(pay.payment_date) >= '2026-08-01'
AND DATE(pay.payment_date) <= '2026-08-31'