ci4/app/Controllers/Client/ClientServiceController.php

SELECT `service_list_id`, `service_name`, `description`, `base_price`, `is_available`
FROM `service_list`
WHERE `is_available` = 1
ORDER BY `service_name` ASC
SELECT `package_id`, `package_name`, `description`, `base_price`, `is_available`
FROM `packages`
ORDER BY `package_name` ASC
---
    public function services(): ResponseInterface|string
    {
        try {
            $access = $this->resolveAccessState();
        } catch (\RuntimeException $e) {
            return redirect()->to('/signin')->with('error', 'Session expired. Please log in again.');
        }

        $activeTab = (string) $this->request->getGet('tab');
        if (! in_array($activeTab, ['services', 'packages'], true)) {
            $activeTab = 'services';
        }

        $services = db_connect()->table('service_list')
            ->select('service_list_id, service_name, description, base_price')
            ->where('is_available', 1)
            ->orderBy('service_name', 'ASC')
            ->get()
            ->getResultArray();

        $packages = db_connect()->table('packages')
            ->select('package_id, package_name, description, base_price')
            ->orderBy('package_name', 'ASC')
            ->get()
            ->getResultArray();