ci4/app/Controllers/Client/ClientDashboardController.php

    public function dashboard(): ResponseInterface|string
    {
        try {
            $access = $this->resolveAccessState();
        } catch (\RuntimeException $e) {
            return redirect()->to('/signin')->with('error', 'Session expired. Please log in again.');
        }
        $user = $access['user'];
        $planHolder = $access['plan_holder'];
        $membershipService = new MembershipService();
        $paymentService = new PaymentService();
        $latestPlan = $planHolder ? $membershipService->getMembershipSummary((int) $planHolder['plan_holder_id']) : null;

        if (! empty($latestPlan['plan_id'])) {
            $totalContribution = (float) ($latestPlan['total_plan_amount'] ?? MembershipService::TOTAL_CONTRIBUTION);
            $paidAmount = $paymentService->getTotalPaidForPlan((int) $latestPlan['plan_id']);
            $latestPlan['paid_amount'] = $paidAmount;
            $latestPlan['total_paid'] = $paidAmount;
            $latestPlan['total_plan_amount'] = $totalContribution;
            $latestPlan['remaining_balance'] = max(0, round($totalContribution - $paidAmount, 2));
        }

        $branchName = '';
        if (! empty($planHolder['branch_id'])) {
            $branch = db_connect()->table('branches')
                ->select('branch_name')
                ->where('branch_id', (int) $planHolder['branch_id'])
                ->get()
                ->getRowArray();
---
SELECT `branch_name`
FROM `branches`
WHERE `branch_id` = 1


        $recentPayments = [];
        if (! empty($latestPlan['plan_id'])) {
            $recentPayments = db_connect()->table('payments')
                ->select('payment_id, payment_date, amount, payment_method, reference_number, official_receipt_number, status, remarks, created_at')
                ->where('plan_id', (int) $latestPlan['plan_id'])
                ->orderBy('payment_id', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT `payment_id`, `payment_date`, `amount`, `payment_method`, `reference_number`, `official_receipt_number`, `status`, `remarks`, `created_at`
FROM `payments`
WHERE `plan_id` = 5
ORDER BY `payment_id` DESC
 LIMIT 5