ci4/app/Controllers/Client/ClientPortalTrait.php

    protected function currentUser(): array
    {
        $userId = (int) session('user_id');
        $roleId = (int) session('role_id');

        if ($userId <= 0 || $roleId !== 4) {
            throw new \RuntimeException('Unauthorized client session.');
        }

        $user = (new UserModel())->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = 17

    protected function currentPlanHolder(): ?array
    {
        $userId = (int) session('user_id');

        return (new PlanHolderModel())
            ->where('user_id', $userId)
            ->orderBy('plan_holder_id', 'DESC')
            ->first();
---
SELECT *
FROM `plan_holders`
WHERE `user_id` = 17
ORDER BY `plan_holder_id` DESC
 LIMIT 1

    protected function latestInitialPayment(int $planHolderId): ?array
    {
        // Return the earliest payment for the plan holder (the initial payment)
        $row = db_connect()->table('payments pay')
            ->select('pay.payment_id, pay.plan_id, pay.amount, pay.payment_date, pay.payment_method, pay.reference_number, pay.official_receipt_number, pay.status, pay.remarks')
            ->join('plans p', 'p.plan_id = pay.plan_id', 'inner')
            ->where('p.plan_holder_id', $planHolderId)
            ->orderBy('pay.payment_id', 'ASC')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT `pay`.`payment_id`, `pay`.`plan_id`, `pay`.`amount`, `pay`.`payment_date`, `pay`.`payment_method`, `pay`.`reference_number`, `pay`.`official_receipt_number`, `pay`.`status`, `pay`.`remarks`
FROM `payments` `pay`
INNER JOIN `plans` `p` ON `p`.`plan_id` = `pay`.`plan_id`
WHERE `p`.`plan_holder_id` = 12
ORDER BY `pay`.`payment_id` ASC
 LIMIT 1