ci4/app/Controllers/Client/ClientPaymentController.php

    public function payment(): ResponseInterface|string
    {
        try {
            $access = $this->resolveAccessState();
        } catch (\RuntimeException $e) {
            return redirect()->to('/signin')->with('error', 'Session expired. Please log in again.');
        }
        $planHolder = $access['plan_holder'];
        $program = \App\Services\MembershipService::getProgramInfo();

        $membershipPlans = [];
        $db = db_connect();
        if ($db->tableExists('membership_programs')) {
            $membershipPlans = $db->table('membership_programs')
                ->select('program_id, program_name')
                ->where('is_active', 1)
                ->orderBy('program_name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `program_id`, `program_name`
FROM `membership_programs`
WHERE `is_active` = 1
ORDER BY `program_name` ASC

        $plan = $this->latestPlan((int) $planHolder['plan_holder_id']);
        $payments = [];
        if ($plan) {
            $payments = (new PaymentModel())
                ->where('plan_id', (int) $plan['plan_id'])
                ->orderBy('payment_id', 'DESC')
                ->findAll();
---
SELECT *
FROM `payments`
WHERE `plan_id` = 7
ORDER BY `payment_id` DESC

    public function advancePayment(): ResponseInterface|string
    {
        try {
            $access = $this->resolveAccessState();
        } catch (\RuntimeException $e) {
            return redirect()->to('/signin')->with('error', 'Session expired. Please log in again.');
        }
        $planHolder = $access['plan_holder'];
        $program = \App\Services\MembershipService::getProgramInfo();

        $membershipPlans = [];
        $db = db_connect();
        if ($db->tableExists('membership_programs')) {
            $membershipPlans = $db->table('membership_programs')
                ->select('program_id, program_name')
                ->where('is_active', 1)
                ->orderBy('program_name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `program_id`, `program_name`
FROM `membership_programs`
WHERE `is_active` = 1
ORDER BY `program_name` ASC

        $plan = $this->latestPlan((int) $planHolder['plan_holder_id']);
        $payments = [];
        if ($plan) {
            $payments = (new PaymentModel())
                ->where('plan_id', (int) $plan['plan_id'])
                ->orderBy('payment_id', 'DESC')
                ->findAll();
---
SELECT *
FROM `payments`
WHERE `plan_id` = 7
ORDER BY `payment_id` DESC