ci4/app/Services/ActivityLogService.php

                }
            }

            return (bool) db_connect()->table('activity_logs')
                ->insert($logData);
---
INSERT INTO `activity_logs` (`user_id`, `action`, `module`, `target_id`, `description`, `old_values`, `new_values`, `ip_address`, `created_at`) VALUES (6, 'created', 'payment', 15, 'Recorded cash payment for plan #5', NULL, '{\"plan_id\":5,\"amount\":240,\"payment_method\":\"cash\",\"status\":\"paid\"}', '::1', '2026-05-20 13:34:29')