ci4/app/Services/MembershipService.php

    public static function getProgramInfo(): array
    {
        $db = db_connect();
        if ($db->tableExists('membership_programs')) {
            $program = $db->table('membership_programs')
                ->select('program_id, program_name, monthly_fee')
                ->where('is_active', 1)
                ->orderBy('program_id', 'ASC')
                ->get()
                ->getRowArray();
---
SELECT `program_id`, `program_name`, `monthly_fee`
FROM `membership_programs`
WHERE `is_active` = 1
ORDER BY `program_id` ASC

    public static function ensureDefaultPackageVersion(): void
    {
        $db = db_connect();

        if (! $db->tableExists('packages') || ! $db->tableExists('package_versions')) {
            return;
        }

        $package = $db->table('packages')
            ->select('package_id')
            ->where('package_id', self::DEFAULT_PACKAGE_ID)
            ->get()
            ->getRowArray();

        if (! $package) {
            return;
        }

        $version = $db->table('package_versions')
            ->select('version_id')
            ->where('package_id', self::DEFAULT_PACKAGE_ID)
            ->where('status', 'active')
            ->orderBy('version_id', 'DESC')
            ->get()
            ->getRowArray();
---
SELECT `package_id`
FROM `packages`
WHERE `package_id` = 1
SELECT `version_id`
FROM `package_versions`
WHERE `package_id` = 1
AND `status` = 'active'
ORDER BY `version_id` DESC

    public static function ensureMembershipProgram(): void
    {
        $db = db_connect();

        if (! $db->tableExists('membership_programs')) {
            return;
        }

        $exists = $db->table('membership_programs')
            ->select('program_id')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT `program_id`
FROM `membership_programs`
 LIMIT 1

    public function getActivePlan(int $planHolderId): ?array
    {
        if ($planHolderId <= 0) {
            return null;
        }

        return $this->planModel
            ->where('plan_holder_id', $planHolderId)
            ->where('status', 'active')
            ->orderBy('plan_id', 'DESC')
            ->first();
---
SELECT *
FROM `plans`
WHERE `plan_holder_id` = 12
AND `status` = 'active'
ORDER BY `plan_id` DESC
 LIMIT 1

    public function getBranchPlans(int $branchId): array
    {
        $builder = $this->planModel
            ->select('plans.plan_id, plans.monthly_fee, plans.remaining_balance, plans.months_paid, plans.status AS plan_status, plans.start_date, ph.branch_id, ph.unique_identifier, u.first_name, u.last_name')
            ->join('plan_holders ph', 'ph.plan_holder_id = plans.plan_holder_id', 'inner')
            ->join('users u', 'u.user_id = ph.user_id', 'inner')
            ->orderBy("CASE WHEN plans.status = 'active' THEN 1 ELSE 2 END", 'ASC', false)
            ->orderBy('plans.plan_id', 'DESC');

        if ($branchId > 0) {
            $builder->where('ph.branch_id', $branchId);
        }

        return $builder->findAll();
---
SELECT `plans`.`plan_id`, `plans`.`monthly_fee`, `plans`.`remaining_balance`, `plans`.`months_paid`, `plans`.`status` AS `plan_status`, `plans`.`start_date`, `ph`.`branch_id`, `ph`.`unique_identifier`, `u`.`first_name`, `u`.`last_name`
FROM `plans`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `plans`.`plan_holder_id`
INNER JOIN `users` `u` ON `u`.`user_id` = `ph`.`user_id`
WHERE `ph`.`branch_id` = 1
ORDER BY CASE WHEN plans.status = 'active' THEN 1 ELSE 2 END ASC, `plans`.`plan_id` DESC

    public function applyMembershipCoverage(int $planId, int $monthsCovered): bool
    {
        if ($planId <= 0 || $monthsCovered <= 0) {
            return false;
        }

        $plan = $this->planModel->find($planId);
---
SELECT *
FROM `plans`
WHERE `plans`.`plan_id` = 5

                $updateData['next_due_date'] = $nextDueDate;
            }

            $this->planModel->update($planId, $updateData);
---
UPDATE `plans` SET `overdue_months` = 0, `membership_state` = 'active', `months_paid` = 3, `payment_coverage_until` = '2026-06-18', `next_due_date` = '2026-06-19'
WHERE `plans`.`plan_id` IN (5)