ci4/app/Services/NotificationService.php

INSERT INTO `notifications` (`user_id`, `message`, `type`, `status`, `created_at`) VALUES (17, 'Your advance payment covering 1 month has been approved.', 'payment_approved', 'unread', '2026-05-20 13:34:29')
---
    public function notify(int $userId, string $message, string $type = 'general', bool $sendEmail = false, bool $sendSms = false): bool
    {
        if ($userId <= 0 || empty($message)) {
            return false;
        }

        $validTypes = ['payment_approved', 'payment_rejected', 'service_approved', 'service_rejected', 'registration_pending', 'service_completed', 'general'];

        if (!in_array($type, $validTypes, true)) {
            $type = 'general';
        }

        $message = trim($message);

        try {
            $created = (bool) db_connect()->table('notifications')->insert([
                'user_id' => $userId,
                'message' => $message,
                'type' => $type,
                // No 'status' column exists on notifications - unread/read is
                // tracked via is_read (defaults to 0) + read_at, not a string.
                'created_at' => date('Y-m-d H:i:s'),
            ]);