ci4/app/Services/PaymentService.php

    public function getBranchMonitoringPayments(int $branchId): array
    {
        if ($branchId <= 0) {
            return [];
        }

        return db_connect()->table('payments pay')
            ->select('pay.payment_id, pay.plan_id, pay.amount, pay.months_covered, pay.payment_date, pay.payment_method, pay.reference_number, pay.official_receipt_number, pay.remarks, pay.status, pay.branch_id, b.branch_name, p.monthly_fee, p.months_paid, p.remaining_balance, p.next_due_date, ph.plan_holder_id, ph.unique_identifier, u.first_name, u.last_name')
            ->join('plans p', 'p.plan_id = pay.plan_id', 'inner')
            ->join('plan_holders ph', 'ph.plan_holder_id = p.plan_holder_id', 'inner')
            ->join('users u', 'u.user_id = ph.user_id', 'inner')
            ->join('branches b', 'b.branch_id = pay.branch_id', 'left')
            ->where('pay.branch_id', $branchId)
            ->orderBy('pay.payment_date', 'DESC')
            ->orderBy('pay.payment_id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `pay`.`payment_id`, `pay`.`plan_id`, `pay`.`amount`, `pay`.`months_covered`, `pay`.`payment_date`, `pay`.`payment_method`, `pay`.`reference_number`, `pay`.`official_receipt_number`, `pay`.`remarks`, `pay`.`status`, `pay`.`branch_id`, `b`.`branch_name`, `p`.`monthly_fee`, `p`.`months_paid`, `p`.`remaining_balance`, `p`.`next_due_date`, `ph`.`plan_holder_id`, `ph`.`unique_identifier`, `u`.`first_name`, `u`.`last_name`
FROM `payments` `pay`
INNER JOIN `plans` `p` ON `p`.`plan_id` = `pay`.`plan_id`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `p`.`plan_holder_id`
INNER JOIN `users` `u` ON `u`.`user_id` = `ph`.`user_id`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `pay`.`branch_id`
WHERE `pay`.`branch_id` = 1
ORDER BY `pay`.`payment_date` DESC, `pay`.`payment_id` DESC

    public function getTotalPaidForPlan(int $planId): float
    {
        if ($planId <= 0) {
            return 0.0;
        }

        return (float) db_connect()->table('payments')
            ->select('COALESCE(SUM(amount), 0) AS total_paid', false)
            ->where('plan_id', $planId)
            ->whereIn('status', ['paid', 'verified'])
            ->get()
            ->getRowArray()['total_paid'] ?? 0;
---
SELECT COALESCE(SUM(amount), 0) AS total_paid
FROM `payments`
WHERE `plan_id` = 5
AND `status` IN ('paid','verified')