ci4/app/Controllers/BranchAdmin/ServiceApplicationController.php

    public function index(): string
    {
        $this->ensureBranchAdminAccess();

        $branchId = (int) session('branch_id');

        $requests = $branchId > 0
            ? db_connect()->table('service_applications sa')
                ->select('sa.application_id, sa.plan_holder_id, sa.package_id, sa.service_list_id, sa.status, sa.created_at, ph.user_id, u.first_name, u.last_name, p.package_name, sl.service_name')
                ->join('plan_holders ph', 'ph.plan_holder_id = sa.plan_holder_id', 'inner')
                ->join('users u', 'u.user_id = ph.user_id', 'inner')
                ->join('packages p', 'p.package_id = sa.package_id', 'left')
                ->join('service_list sl', 'sl.service_list_id = sa.service_list_id', 'left')
                ->where('ph.branch_id', $branchId)
                ->orderBy('sa.created_at', 'DESC')
                ->get()
                ->getResultArray()
---
SELECT `sa`.`application_id`, `sa`.`plan_holder_id`, `sa`.`package_id`, `sa`.`service_list_id`, `sa`.`status`, `sa`.`created_at`, `ph`.`user_id`, `u`.`first_name`, `u`.`last_name`, `p`.`package_name`, `sl`.`service_name`
FROM `service_applications` `sa`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `sa`.`plan_holder_id`
INNER JOIN `users` `u` ON `u`.`user_id` = `ph`.`user_id`
LEFT JOIN `packages` `p` ON `p`.`package_id` = `sa`.`package_id`
LEFT JOIN `service_list` `sl` ON `sl`.`service_list_id` = `sa`.`service_list_id`
WHERE `ph`.`branch_id` = 1
ORDER BY `sa`.`created_at` DESC