ci4/app/Controllers/Auth.php

    public function attemptLogin()
    {
        $identifier = trim((string) $this->request->getPost('identifier'));
        $password   = (string) $this->request->getPost('password');

        if ($identifier === '' || $password === '') {
            return redirect()->back()->withInput()->with('error', 'Username/email and password are required.');
        }

        $userModel = new UserModel();
        // Joins branches/roles so the topbar's name/branch chip (CareSync UI)
        // has what it needs without a second query - left join on branches
        // since a System Admin may have no branch_id.
        $user = $userModel
            ->select('users.*, branches.branch_name AS branch_name, roles.role_name AS role_name')
            ->join('branches', 'branches.branch_id = users.branch_id', 'left')
            ->join('roles', 'roles.role_id = users.role_id', 'left')
            ->groupStart()
            ->where('users.username', $identifier)
            ->orWhere('users.email', $identifier)
            ->groupEnd()
            ->first();

        if (! $user || ! password_verify($password, (string) $user['password_hash'])) {
            return redirect()->back()->withInput()->with('error', 'Invalid credentials.');
---
SELECT *
FROM `users`
WHERE   (
`username` = 'aclanregine2@gmail.com'
OR `email` = 'aclanregine2@gmail.com'
 )
 LIMIT 1

            'role_name'   => (string) ($user['role_name'] ?? ''),
        ]);

        $userModel->update((int) $user['user_id'], ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2026-05-20 13:33:19'
WHERE `users`.`user_id` IN (6)