ci4/app/Controllers/Dashboard.php

SELECT `sa`.`status`, COUNT(sa.application_id) AS total
FROM `service_applications` `sa`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `sa`.`plan_holder_id`
WHERE `ph`.`branch_id` = 1
GROUP BY `sa`.`status`
---
    private function getServiceRequestCounts(int $branchId): array
    {
        if ($branchId <= 0) {
            return [];
        }

        $rows = db_connect()->table('service_applications sa')
            ->select('sa.status, COUNT(sa.application_id) AS total')
            ->join('plan_holders ph', 'ph.plan_holder_id = sa.plan_holder_id', 'inner')
            ->where('ph.branch_id', $branchId)
            ->groupBy('sa.status')
            ->get()
            ->getResultArray();

SELECT `sc`.`calendar_id`, `sc`.`event_type`, `sc`.`event_date`, `sc`.`event_time`, `sc`.`location`, `sc`.`status`, `sc`.`assigned_staff_ids`, `ph`.`unique_identifier`, `u`.`first_name`, `u`.`last_name`, COALESCE(sl.service_name, sc.event_type) AS event_name
FROM `service_calendar` `sc`
LEFT JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `sc`.`plan_holder_id`
LEFT JOIN `users` `u` ON `u`.`user_id` = `ph`.`user_id`
LEFT JOIN `service_list` `sl` ON `sl`.`service_list_id` = `sc`.`service_id`
WHERE `sc`.`branch_id` = 1
AND `sc`.`event_date` = '2026-05-20'
AND `sc`.`status` IN ('scheduled','in-progress')
ORDER BY `sc`.`event_time` ASC
 LIMIT 10
---
    private function getTodayServiceCalendar(int $branchId): array
    {
        if ($branchId <= 0 || ! $this->serviceCalendarExists()) {
            return [];
        }

        return db_connect()->table('service_calendar sc')
            ->select('sc.calendar_id, sc.event_type, sc.event_date, sc.event_time, sc.location, sc.status, sc.assigned_staff_ids, ph.unique_identifier, u.first_name, u.last_name, COALESCE(sl.service_name, sc.event_type) AS event_name')
            ->join('plan_holders ph', 'ph.plan_holder_id = sc.plan_holder_id', 'left')
            ->join('users u', 'u.user_id = ph.user_id', 'left')
            ->join('service_list sl', 'sl.service_list_id = sc.service_id', 'left')
            ->where('sc.branch_id', $branchId)
            ->where('sc.event_date', date('Y-m-d'))
            ->whereIn('sc.status', ['scheduled', 'in-progress'])
            ->orderBy('sc.event_time', 'ASC')
            ->limit(10)
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `service_calendar`
WHERE `branch_id` = 1
AND `event_date` >= '2026-05-20'
AND `event_date` <= '2026-05-27'
AND `status` = 'scheduled'
---
    private function countUpcomingServices(int $branchId): int
    {
        if ($branchId <= 0 || ! $this->serviceCalendarExists()) {
            return 0;
        }

        return (int) db_connect()->table('service_calendar')
            ->where('branch_id', $branchId)
            ->where('event_date >=', date('Y-m-d'))
            ->where('event_date <=', date('Y-m-d', strtotime('+7 days')))
            ->where('status', 'scheduled')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `service_calendar`
WHERE `branch_id` = 1
AND `status` IN ('scheduled','in-progress')
---
    private function countServiceCalendarEvents(int $branchId, array $statuses): int
    {
        if ($branchId <= 0 || empty($statuses) || ! $this->serviceCalendarExists()) {
            return 0;
        }

        return (int) db_connect()->table('service_calendar')
            ->where('branch_id', $branchId)
            ->whereIn('status', $statuses)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `staff_schedules`
WHERE `branch_id` = 1
AND `schedule_date` = '2026-05-20'
AND `status` IN ('scheduled','assigned')
---
    private function countStaffOnDuty(int $branchId): int
    {
        if ($branchId <= 0 || ! $this->staffSchedulesExists()) {
            return 0;
        }

        return (int) db_connect()->table('staff_schedules')
            ->where('branch_id', $branchId)
            ->where('schedule_date', date('Y-m-d'))
            ->whereIn('status', ['scheduled', 'assigned'])
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `payments` `pay`
INNER JOIN `plans` `p` ON `p`.`plan_id` = `pay`.`plan_id`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `p`.`plan_holder_id`
WHERE `ph`.`branch_id` = 1
AND `pay`.`status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `service_calendar`
WHERE `branch_id` = 1
AND `event_date` = '2026-05-20'
AND `status` = 'scheduled'
AND   (
`assigned_staff_ids` IS NULL
OR `assigned_staff_ids` = '[]'
 )
---
    private function getPaymentAlerts(int $branchId, array $memberStats, array $serviceRequestCounts): array
    {
        if ($branchId <= 0) {
            return [];
        }

        $db = db_connect();
        $pendingPayments = (int) $db->table('payments pay')
            ->join('plans p', 'p.plan_id = pay.plan_id', 'inner')
            ->join('plan_holders ph', 'ph.plan_holder_id = p.plan_holder_id', 'inner')
            ->where('ph.branch_id', $branchId)
            ->where('pay.status', 'pending')
            ->countAllResults();

        $unassignedServices = 0;
        if ($this->serviceCalendarExists()) {
            $unassignedServices = (int) $db->table('service_calendar')
                ->where('branch_id', $branchId)
                ->where('event_date', date('Y-m-d'))
                ->where('status', 'scheduled')
                ->groupStart()
                    ->where('assigned_staff_ids', null)
                    ->orWhere('assigned_staff_ids', '[]')
                ->groupEnd()
                ->countAllResults();

SELECT `al`.*, `u`.`first_name`, `u`.`last_name`
FROM `activity_logs` `al`
LEFT JOIN `users` `u` ON `u`.`user_id` = `al`.`user_id`
WHERE `u`.`branch_id` = 1
ORDER BY `al`.`created_at` DESC
 LIMIT 8
---
    private function getRecentBranchActivity(int $branchId, int $limit = 8): array
    {
        if ($branchId <= 0) {
            return [];
        }

        return db_connect()->table('activity_logs al')
            ->select('al.*, u.first_name, u.last_name')
            ->join('users u', 'u.user_id = al.user_id', 'left')
            ->where('u.branch_id', $branchId)
            ->orderBy('al.created_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT DATE_FORMAT(pay.payment_date, '%Y-%m') AS month, SUM(pay.amount) AS total
FROM `payments` `pay`
INNER JOIN `plans` `p` ON `p`.`plan_id` = `pay`.`plan_id`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `p`.`plan_holder_id`
WHERE `ph`.`branch_id` = 1
AND `pay`.`status` = 'approved'
AND `pay`.`payment_date` >= '2025-12-01'
GROUP BY `month`
---
    private function getPaymentAnalytics(int $branchId, int $months = 6): array
    {
        if ($branchId <= 0) {
            return [
                'months' => [],
                'totals' => [],
                'method_breakdown' => [],
            ];
        }

        $db = db_connect();
        $startDate = (new \DateTime(sprintf('first day of -%d months', $months - 1)))->format('Y-m-01');
        $labels = [];
        $totals = [];

        for ($monthOffset = 0; $monthOffset < $months; $monthOffset++) {
            $date = (new \DateTime($startDate))->modify(sprintf('+%d months', $monthOffset));
            $label = $date->format('Y-m');
            $labels[$label] = $date->format('M Y');
            $totals[$label] = 0.0;
        }

        $result = $db->table('payments pay')
            ->select("DATE_FORMAT(pay.payment_date, '%Y-%m') AS month, SUM(pay.amount) AS total")
            ->join('plans p', 'p.plan_id = pay.plan_id', 'inner')
            ->join('plan_holders ph', 'ph.plan_holder_id = p.plan_holder_id', 'inner')
            ->where('ph.branch_id', $branchId)
            ->where('pay.status', 'approved')
            ->where('pay.payment_date >=', $startDate)
            ->groupBy('month')
            ->get()
            ->getResultArray();

SELECT `pay`.`payment_method`, SUM(pay.amount) AS total
FROM `payments` `pay`
INNER JOIN `plans` `p` ON `p`.`plan_id` = `pay`.`plan_id`
INNER JOIN `plan_holders` `ph` ON `ph`.`plan_holder_id` = `p`.`plan_holder_id`
WHERE `ph`.`branch_id` = 1
AND `pay`.`status` = 'approved'
AND DATE_FORMAT(pay.payment_date, "%Y-%m") = '2026-05'
GROUP BY `pay`.`payment_method`
---
            }
        }

        $methodRows = $db->table('payments pay')
            ->select('pay.payment_method, SUM(pay.amount) AS total')
            ->join('plans p', 'p.plan_id = pay.plan_id', 'inner')
            ->join('plan_holders ph', 'ph.plan_holder_id = p.plan_holder_id', 'inner')
            ->where('ph.branch_id', $branchId)
            ->where('pay.status', 'approved')
            ->where('DATE_FORMAT(pay.payment_date, "%Y-%m")', date('Y-m'))
            ->groupBy('pay.payment_method')
            ->get()
            ->getResultArray();