ci4/app/Controllers/PaymentTracking.php

    public function recordCash()
    {
        $roleId = (int) session('role_id');
        if (! in_array($roleId, [2, 3], true)) {
            return redirect()->to('/unauthorized');
        }

        $rules = [
            'plan_id' => 'required|is_natural_no_zero',
            'amount' => 'required|decimal',
            'months_covered' => 'required|is_natural_no_zero',
            'payment_date' => 'required|valid_date[Y-m-d]',
            'payment_method' => 'required|in_list[cash]',
            'official_receipt_number' => $roleId === 2 ? 'required|max_length[100]' : 'permit_empty|max_length[100]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', implode(' ', $this->validator->getErrors()));
        }

        $planId = (int) $this->request->getPost('plan_id');
        $amount = (float) $this->request->getPost('amount');
        $monthsCovered = max(1, (int) $this->request->getPost('months_covered'));
        $branchId = (int) session('branch_id');

        $plan = (new PlanModel())->find($planId);
---
SELECT *
FROM `plans`
WHERE `plans`.`plan_id` = 5

            return redirect()->back()->withInput()->with('error', 'Payment exceeds remaining balance.');
        }

        $holder = db_connect()->table('plan_holders')
            ->select('branch_id')
            ->where('plan_holder_id', (int) $plan['plan_holder_id'])
            ->get()
            ->getRowArray();
---
SELECT `branch_id`
FROM `plan_holders`
WHERE `plan_holder_id` = 12

        // Filter to only include columns that exist in the payments table
        $paymentData = $this->filterPaymentData($paymentData);

        $paymentId = (int) (new PaymentModel())->insert($paymentData, true);
---
INSERT INTO `payments` (`plan_id`, `amount`, `months_covered`, `payment_date`, `payment_method`, `reference_number`, `received_by`, `branch_id`, `status`, `official_receipt_number`, `remarks`, `verified_by`, `verified_at`) VALUES (5, 240, 1, '2026-05-20', 'cash', '2026-0003', 6, 1, 'paid', '2026-0003', 'Recorded at branch counter', 6, '2026-05-20 13:34:29')

        $notificationService = new NotificationService();
        $activityLogService = new ActivityLogService();

        $userId = (int) (db_connect()->table('plan_holders')->select('user_id')->where('plan_holder_id', (int) $plan['plan_holder_id'])->get()->getRowArray()['user_id'] ?? 0);
---
SELECT `user_id`
FROM `plan_holders`
WHERE `plan_holder_id` = 12

    private function isInitialPayment(int $paymentId, int $planId, int $planHolderId): bool
    {
        if ($paymentId <= 0 || $planId <= 0 || $planHolderId <= 0) {
            return false;
        }

        $holder = db_connect()->table('plan_holders')
            ->select('status')
            ->where('plan_holder_id', $planHolderId)
            ->get()
            ->getRowArray();

        $holderStatus = strtolower((string) ($holder['status'] ?? ''));
        if ($holderStatus === 'inactive') {
            return true;
        }

        $earliestPayment = db_connect()->table('payments')
            ->select('payment_id, plan_id')
            ->where('plan_id', $planId)
            ->orderBy('payment_id', 'ASC')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT `status`
FROM `plan_holders`
WHERE `plan_holder_id` = 12
SELECT `payment_id`, `plan_id`
FROM `payments`
WHERE `plan_id` = 5
ORDER BY `payment_id` ASC
 LIMIT 1